In [2]:
import pandas as pd

In [3]:
# df= pd.read_csv('data/gb_sem_8_cw.csv')

In [4]:
df = pd.read_excel('data/gb_sem_8_hm.xlsx')

d:\Mytraining\.venv.AB.Testing\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [5]:
df.head()

   USER_ID VARIANT_NAME  REVENUE
0      737      variant      0.0
1     2423      control      0.0
2     9411      control      0.0
3     7311      control      0.0
4     6174      variant      0.0

In [6]:
df.nunique()

USER_ID         6324
VARIANT_NAME       2
REVENUE          101
dtype: int64

In [29]:
a = df.\
      groupby('USER_ID').\
      agg({'VARIANT_NAME': pd.Series.nunique})
a.head()

   USER_ID  VARIANT_NAME
0        2             1
1        3             2
2        4             1
3        5             1
4        6             1

In [68]:
more_than_one_types = a.query('VARIANT_NAME == 1')

more_than_one_types

      USER_ID  VARIANT_NAME
0           2             1
2           4             1
3           5             1
4           6             1
5           9             1
...       ...           ...
6317     9990             1
6318     9992             1
6319     9993             1
6320     9995             1
6322     9998             1

[4783 rows x 2 columns]

In [70]:
df_new = df[df.USER_ID.isin(more_than_one_types.USER_ID)].sort_values('USER_ID')
df_new

      USER_ID VARIANT_NAME  REVENUE
3479        2      control      0.0
7076        2      control      0.0
2406        2      control      0.0
9077        4      variant      0.0
9155        5      variant      0.0
...       ...          ...      ...
3260     9992      control      0.0
9290     9993      control      0.0
2749     9995      variant      0.0
5673     9995      variant      0.0
1064     9998      control      0.0

[6070 rows x 3 columns]

In [60]:
df_new.shape

(6070, 3)

In [62]:
df.describe()

            USER_ID       REVENUE
count  10000.000000  10000.000000
mean    4981.080200      0.099447
std     2890.590115      2.318529
min        2.000000      0.000000
25%     2468.750000      0.000000
50%     4962.000000      0.000000
75%     7511.500000      0.000000
max    10000.000000    196.010000